package dz;

import java.util.Arrays;

//Задача №4
//Дана строка:
//String s = “Перестановочный алгоритм быстрого действия”;
//необходимо вывести все буквы “о” из этой строки.
//Для указанной строки ответ будет “ооооо” (или в столбик)
public class Dz5_4 {
    public static void main(String[] args) {
        String s = "Перестановочный алгоритм быстрого действия";

        System.out.println(s.indexOf('о'));
//        s.toCharArray();
//        String[] strings = {"Перестановочный алгоритм быстрого действия"};
//        for (int i = 0; i < strings.length; i++) {
//            if (strings[i] == "о") {
//                System.out.println(strings[i]);
//        System.out.println(s.Arrays.toString());
//        for (int i = 0; i < s.length() ; i++) {
//            if(s.[i] = "о"){
//                System.out.println();
//            }
//        }
//        System.out.println(Arrays.toString(s.split("о")));

    }
}
