package dz;
//Задача №3
/// /Необходимо вывести все числа кратные 4 между числами 40 и 60 включительно.
/// /без использования конструкции if (шаг цикла на ваше усмотрение).
public class DzTasc3_23Var2 {
    public static void main(String[] args) {
        for (int i = 40; i <= 60; i = i + 4) {
            System.out.println(i + " ");

        }
    }
}
